# Pandas

Pandas é uma biblioteca para gestão de dados, provendo funcionalidades para leitura de diversas estruturas de dados, bem como métodos para processamento e transformação dos mesmos. Além disso, provê gráficos para análise.

In [1]:
import numpy as np
import pandas as pd

## Série de dados

### Criando uma Série de dados

In [2]:
labels = ['a','b','c'] # lista de labels

lista = [10,20,30] # lista de valores

arr = np.array([10,20,30]) # array numpy

d = {'a':10,'b':20,'c':30} # dicionário de dados

#### Usando listas

In [3]:
pd.Series(data=lista)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=lista,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(lista,labels)

a    10
b    20
c    30
dtype: int64

#### Usando numpy array

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

#### Usando dicionários

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

A Série de dados pode ser de qualquer tipo de valores

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

### Trabalhando com indíces

In [10]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany','USSR', 'Japan'])

In [11]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1['USA']

1

Quando se opera com Séries, importante relacionar os indíces. Perceba que os indíces abaixo não existentes nas duas séries possuem valores "NaN"

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## Dataframe

In [16]:
from numpy.random import randn

In [17]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [18]:
df

          W         X         Y         Z
A -0.255853  2.018389  2.147497 -1.446249
B -1.922210  0.348965  1.058377  2.394758
C -0.417369 -0.148747 -0.256459 -0.621828
D -0.638321 -1.114043 -0.542587 -0.218008
E  0.064802  0.422164 -0.361436 -0.305341

In [19]:
df['W']

A   -0.255853
B   -1.922210
C   -0.417369
D   -0.638321
E    0.064802
Name: W, dtype: float64

In [20]:
df[['W','Z']]

          W         Z
A -0.255853 -1.446249
B -1.922210  2.394758
C -0.417369 -0.621828
D -0.638321 -0.218008
E  0.064802 -0.305341

In [21]:
df.W

A   -0.255853
B   -1.922210
C   -0.417369
D   -0.638321
E    0.064802
Name: W, dtype: float64

DataFrame Columns are just Series

In [22]:
type(df['W'])

pandas.core.series.Series

#### Criando uma nova coluna

In [23]:
df['nova'] = df['W'] + df['Y']

In [24]:
df

          W         X         Y         Z      nova
A -0.255853  2.018389  2.147497 -1.446249  1.891644
B -1.922210  0.348965  1.058377  2.394758 -0.863833
C -0.417369 -0.148747 -0.256459 -0.621828 -0.673829
D -0.638321 -1.114043 -0.542587 -0.218008 -1.180907
E  0.064802  0.422164 -0.361436 -0.305341 -0.296634

#### Removendo coluna

In [25]:
df.drop('nova',axis=1) # Observe o atributo "axis = 1"

          W         X         Y         Z
A -0.255853  2.018389  2.147497 -1.446249
B -1.922210  0.348965  1.058377  2.394758
C -0.417369 -0.148747 -0.256459 -0.621828
D -0.638321 -1.114043 -0.542587 -0.218008
E  0.064802  0.422164 -0.361436 -0.305341

In [26]:
# Perceba que ao imprimir o dataframe abaixo a coluna não foi removida de fato. 
df

          W         X         Y         Z      nova
A -0.255853  2.018389  2.147497 -1.446249  1.891644
B -1.922210  0.348965  1.058377  2.394758 -0.863833
C -0.417369 -0.148747 -0.256459 -0.621828 -0.673829
D -0.638321 -1.114043 -0.542587 -0.218008 -1.180907
E  0.064802  0.422164 -0.361436 -0.305341 -0.296634

In [27]:
# Apenas com o "inplace" é que, de fato, removemos a coluna do dataframe em questão. Mas e o que aconteceu na célula anterior?
df.drop('nova', axis=1, inplace=True)

In [28]:
df

          W         X         Y         Z
A -0.255853  2.018389  2.147497 -1.446249
B -1.922210  0.348965  1.058377  2.394758
C -0.417369 -0.148747 -0.256459 -0.621828
D -0.638321 -1.114043 -0.542587 -0.218008
E  0.064802  0.422164 -0.361436 -0.305341

Podemos então remover uma linha:

In [29]:
df.drop('E',axis=0) # Repare no valor do "axis = 0" novamente

          W         X         Y         Z
A -0.255853  2.018389  2.147497 -1.446249
B -1.922210  0.348965  1.058377  2.394758
C -0.417369 -0.148747 -0.256459 -0.621828
D -0.638321 -1.114043 -0.542587 -0.218008

#### Selecionando linha

In [30]:
df.loc['A'] # Baseado no label

W   -0.255853
X    2.018389
Y    2.147497
Z   -1.446249
Name: A, dtype: float64

Ou então baseado em posição da linha:

In [31]:
df.iloc[2]

W   -0.417369
X   -0.148747
Y   -0.256459
Z   -0.621828
Name: C, dtype: float64

#### Selecionando um subconjunto de linhas e colunas

In [32]:
df.loc['B','Y']

1.0583773280921682

In [33]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.255853  2.147497
B -1.922210  1.058377

### Seleção condicional

In [34]:
df

          W         X         Y         Z
A -0.255853  2.018389  2.147497 -1.446249
B -1.922210  0.348965  1.058377  2.394758
C -0.417369 -0.148747 -0.256459 -0.621828
D -0.638321 -1.114043 -0.542587 -0.218008
E  0.064802  0.422164 -0.361436 -0.305341

In [35]:
df>0

       W      X      Y      Z
A  False   True   True  False
B  False   True   True   True
C  False  False  False  False
D  False  False  False  False
E   True   True  False  False

In [36]:
df[df>0]

          W         X         Y         Z
A       NaN  2.018389  2.147497       NaN
B       NaN  0.348965  1.058377  2.394758
C       NaN       NaN       NaN       NaN
D       NaN       NaN       NaN       NaN
E  0.064802  0.422164       NaN       NaN

In [37]:
df[df['W']>0]

          W         X         Y         Z
E  0.064802  0.422164 -0.361436 -0.305341

In [38]:
df[df['W']>0]['Y']

E   -0.361436
Name: Y, dtype: float64

In [39]:
df[df['W']>0][['Y','X']]

          Y         X
E -0.361436  0.422164

Para mais de uma condição, podemos utilizar & (AND) e | (OR)

In [40]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## Operações de indíce

In [41]:
df

          W         X         Y         Z
A -0.255853  2.018389  2.147497 -1.446249
B -1.922210  0.348965  1.058377  2.394758
C -0.417369 -0.148747 -0.256459 -0.621828
D -0.638321 -1.114043 -0.542587 -0.218008
E  0.064802  0.422164 -0.361436 -0.305341

In [42]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.255853  2.018389  2.147497 -1.446249
1     B -1.922210  0.348965  1.058377  2.394758
2     C -0.417369 -0.148747 -0.256459 -0.621828
3     D -0.638321 -1.114043 -0.542587 -0.218008
4     E  0.064802  0.422164 -0.361436 -0.305341

In [43]:
newind = 'CA NY WY OR CO'.split()

In [44]:
df['States'] = newind

In [45]:
df

          W         X         Y         Z States
A -0.255853  2.018389  2.147497 -1.446249     CA
B -1.922210  0.348965  1.058377  2.394758     NY
C -0.417369 -0.148747 -0.256459 -0.621828     WY
D -0.638321 -1.114043 -0.542587 -0.218008     OR
E  0.064802  0.422164 -0.361436 -0.305341     CO

In [46]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.255853  2.018389  2.147497 -1.446249
NY     -1.922210  0.348965  1.058377  2.394758
WY     -0.417369 -0.148747 -0.256459 -0.621828
OR     -0.638321 -1.114043 -0.542587 -0.218008
CO      0.064802  0.422164 -0.361436 -0.305341

In [47]:
df

          W         X         Y         Z States
A -0.255853  2.018389  2.147497 -1.446249     CA
B -1.922210  0.348965  1.058377  2.394758     NY
C -0.417369 -0.148747 -0.256459 -0.621828     WY
D -0.638321 -1.114043 -0.542587 -0.218008     OR
E  0.064802  0.422164 -0.361436 -0.305341     CO

In [48]:
df.set_index('States',inplace=True)

In [49]:
df

               W         X         Y         Z
States
CA     -0.255853  2.018389  2.147497 -1.446249
NY     -1.922210  0.348965  1.058377  2.394758
WY     -0.417369 -0.148747 -0.256459 -0.621828
OR     -0.638321 -1.114043 -0.542587 -0.218008
CO      0.064802  0.422164 -0.361436 -0.305341

# Groupby
Para quem conhece SQL, perceberá que funciona de maneira semelhante. Portanto, a ideia é agrupar valores semelhantes de maneira que se possa aplicar funções agregadoras.

In [50]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]} # Cria um dicionário

In [51]:
df = pd.DataFrame(data)

In [52]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

#### Agora vamos aplicar o groupby para identificar alguns valores sobre grupos

In [53]:
df.groupby('Company')

Perceba que ele retorna um objeto. Com ele poderemos aplicar as funções de agregação.

In [54]:
by_comp = df.groupby("Company")

Vamos obter a média por "Company"

In [55]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [56]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

O desvio padrão

In [57]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [58]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [59]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [60]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [61]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging, Joining e Concatenação

In [62]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [63]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [64]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [65]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [66]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [67]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenação
Concatenar significa basicamente juntar os valores. Importante destacar que os dataframes precisam ter a mesma dimensão.

In [68]:
pd.concat([df1,df2,df3]) # concatenando em linha

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [69]:
pd.concat([df1,df2,df3],axis=1) # concatenando em coluna

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
Semelhante à função SQL, é possível unir as colunas baseadas em uma chave

In [70]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [71]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [72]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [73]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Joining
Semelhante ao Merge, une as colunas com base no critério. Contudo, a chave aqui é o indíce dos dataframes, sendo unificados mesmo quando os indíces não existem mutuamente.

In [74]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [75]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [76]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operações

In [77]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Valores únicos

In [78]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [79]:
df['col2'].nunique()

3

In [80]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Aplicando funções

In [81]:
def times2(x):
    return x*2

In [82]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [83]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [84]:
df['col1'].sum()

10

#### Removendo coluna

In [85]:
del df['col1']

In [86]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Lista de colunas do dataframe

In [87]:
df.columns

Index(['col2', 'col3'], dtype='object')

#### Ordenando o dataframe

In [88]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [89]:
df.sort_values(by='col2') #inplace=False por padrão

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

#### Verificando valores nulos

In [90]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

#### Removendo valores NaN

In [91]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Preenchendo valores NaN

In [92]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [93]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [98]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [107]:
df.loc[0] = 1

In [108]:
df

       A    B  C  D
0      1    1  1  1
1  Teste  one  y  3
2  Teste  two  x  2
3  Teste  two  y  5
4  Teste  one  x  4
5  Teste  one  y  1

# Entrada e Saída de dados

## CSV

### CSV Input

In [96]:
df = pd.read_csv('automobile.txt')
df

,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.60,...,130,mpfi,3.47,2.68,9.00,111,5000,21,27,13495
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.00,111,5000,21,27,16500
1,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.00,154,5000,19,26,16500
2,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.00,102,5500,24,30,13950
3,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.00,115,5500,18,22,17450
4,2,?,audi,gas,std,two,sedan,fwd,front,99.8,...,136,mpfi,3.19,3.40,8.50,110,5500,19,25,15250
5,1,158,audi,gas,std,four,sedan,fwd,front,105.8,...,136,mpfi,3.19,3.40,8.50,110,5500,19,25,17710
6,1,?,audi,gas,std,four,wagon,fwd,front,105.8,...,136,mpfi,3.19,3.40,8.50,110,5500,19,25,18920
7,1,158,audi,gas,turbo,four,sedan,fwd,front,105.8,...,131,mpfi,3.13,3.40,8.30,140,5500,17,20,23875
8,0,?,audi,gas,turbo,two,hatchback,4wd,front,99.5,...,131,mpfi,3.13,3.40,7.00,160,5500,16,22,?
9,2,192,bmw,gas,std,two,sedan,rwd,front,101.2,...,108,mpfi,3.50,2.80,8.80,101,5800,23,29,16430
10,0,192,bmw,gas,std,four,sedan,rwd,front,101.2,...,108,mpfi,3.50,2.80,8.80,101,5800,23,29,16925
11,0,188,bmw,gas,std,two,sedan,rwd,front,101.2,...,164,mpfi,3.31,3.19,9.00,121,4250,21,28,20970
12,0,188,bmw,gas,std,four,sedan,rwd,front,101.2,...,164,mpfi,3.31,3.19,9.00,121,4250,21,28,21105
13,1,?,bmw,gas,std,four,sedan,rwd,front,103.5,...,164,mpfi,3.31,3.19,9.00,121,4250,20,25,24565
14,0,?,bmw,gas,std,four,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.00,182,5400,16,22,30760
15,0,?,bmw,gas,std,two,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.00,182,5400,16,22,41315
16,0,?,bmw,gas,std,four,sedan,rwd,front,110.0,...,209,mpfi,3.62,3.39,8.00,182,5400,15,20,36880
17,2,121,chevrolet,gas,std,two,hatchback,fwd,front,88.4,...,61,2bbl,2.91,3.03,9.50,48,5100,47,53,5151
18,1,98,chevrolet,gas,std,two,hatchback,fwd,front,94.5,...,90,2bbl,3.03,3.11,9.60,70,5400,38,43,6295
19,0,81,chevrolet,gas,std,four,sedan,fwd,front,94.5,...,90,2bbl,3.03,3.11,9.60,70,5400,38,43,6575
20,1,118,dodge,gas,std,two,hatchback,fwd,front,93.7,...,90,2bbl,2.97,3.23,9.41,68,5500,37,41,5572
21,1,118,dodge,gas,std,two,hatchback,fwd,front,93.7,...,90,2bbl,2.97,3.23,9.40,68,5500,31,38,6377
22,1,118,dodge,gas,turbo,two,hatchback,fwd,front,93.7,...,98,mpfi,3.03,3.39,7.60,102,5500,24,30,7957
23,1,148,dodge,gas,std,four,hatchback,fwd,front,93.7,...,90,2bbl,2.97,3.23,9.40,68,5500,31,38,6229
24,1,148,dodge,gas,std,four,sedan,fwd,front,93.7,...,90,2bbl,2.97,3.23,9.40,68,5500,31,38,6692
25,1,148,dodge,gas,std,four,sedan,fwd,front,93.7,...,90,2bbl,2.97,3.23,9.40,68,5500,31,38,7609
26,1,148,dodge,gas,turbo,?,sedan,fwd,front,93.7,...,98,mpfi,3.03,3.39,7.60,102,5500,24,30,8558
27,-1,110,dodge,gas,std,four,wagon,fwd,front,103.3,...,122,2bbl,3.34,3.46,8.50,88,5000,24,30,8921
28,3,145,dodge,gas,turbo,two,hatchback,fwd,front,95.9,...,156,mfi,3.60,3.90,7.00,145,5000,19,24,12964
29,2,137,honda,gas,std,two,hatchback,fwd,front,86.6,...,92,1bbl,2.91,3.41,9.60,58,4800,49,54,6479
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
174,-1,65,toyota,gas,std,four,hatchback,fwd,front,102.4,...,122,mpfi,3.31,3.54,8.70,92,4200,27,32,9988
175,-1,65,toyota,gas,std,four,sedan,fwd,front,102.4,...,122,mpfi,3.31,3.54,8.70,92,4200,27,32,10898
176,-1,65,toyota,gas,std,four,hatchback,fwd,front,102.4,...,122,mpfi,3.31,3.54,8.70,92,4200,27,32,11248
177,3,197,toyota,gas,std,two,hatchback,rwd,front,102.9,...,171,mpfi,3.27,3.35,9.30,161,5200,20,24,16558
178,3,197,toyota,gas,std,two,hatchback,rwd,front,102.9,...,171,mpfi,3.27,3.35,9.30,161,5200,19,24,15998
179,-1,90,toyota,gas,std,four,sedan,rwd,front,104.5,...,171,mpfi,3.27,3.35,9.20,156,5200,20,24,15690
180,-1,?,toyota,gas,std,four,wagon,rwd,front,104.5,...,161,mpfi,3.27,3.35,9.20,156,5200,19,24,15750
181,2,122,volkswagen,diesel,std,two,sedan,fwd,front,97.3,...,97,idi,3.01,3.40,23.00,52,4800,37,46,7775
182,2,122,volkswagen,gas,std,two,sedan,fwd,front,97.3,...,109,mpfi,3.19,3.40,9.00,85,5250,27,34,7975
183,2,94,volkswagen,diesel,std,four,sedan,fwd,front,97.3,...,97,idi,3.01,3.40,23.00,52,4800,37,46,7995
184,2,94,volkswagen,gas,std,four,sedan,fwd,front,97.3,...,109,mpfi,3.19,3.40,9.00,85,5250,27,34,8195
185,2,94,volkswagen,gas,std,four,sedan,fwd,front,97.3,...,109,mpfi,3.19,3.40,9.00,85,5250,27,34,8495
186,2,94,volkswagen,diesel,turbo,four,sedan,fwd,front,97.3,...,97,idi,3.01,3.40,23.00,68,4500,37,42,9495
187,2,94,volkswagen,gas,std,four,sedan,fwd,front,97.3,...,109,mpfi,3.19,3.40,10.00,100,5500,26,32,9995
188,3,?,volkswagen,gas,std,two,convertible,fwd,front,94.5,...,109,mpfi,3.19,3.40,8.50,90,5500,24,29,11595
189,3,256,volkswagen,gas,std,two,hatchback,fwd,front,94.5,...,109,mpfi,3.19,3.40,8.50,90,5500,24,29,9980
190,0,?,volkswagen,gas,std,four,sedan,fwd,front,100.4,...,136,mpfi,3.19,3.40,8.50,110,5500,19,24,13295
191,0,?,volkswagen,diesel,turbo,four,sedan,fwd,front,100.4,...,97,idi,3.01,3.40,23.00,68,4500,33,38,13845
192,0,?,volkswagen,gas,std,four,wagon,fwd,front,100.4,...,109,mpfi,3.19,3.40,9.00,88,5500,25,31,12290
193,-2,103,volvo,gas,std,four,sedan,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.50,114,5400,23,28,12940
194,-1,74,volvo,gas,std,four,wagon,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.50,114,5400,23,28,13415
195,-2,103,volvo,gas,std,four,sedan,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.50,114,5400,24,28,15985
196,-1,74,volvo,gas,std,four,wagon,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.50,114,5400,24,28,16515
197,-2,103,volvo,gas,turbo,four,sedan,rwd,front,104.3,...,130,mpfi,3.62,3.15,7.50,162,5100,17,22,18420
198,-1,74,volvo,gas,turbo,four,wagon,rwd,front,104.3,...,130,mpfi,3.62,3.15,7.50,162,5100,17,22,18950
199,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.50,114,5400,23,28,16845
200,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.70,160,5300,19,25,19045
201,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.80,134,5500,18,23,21485
202,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.40,23.00,106,4800,26,27,22470
203,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.50,114,5400,19,25,22625

### CSV Output

In [4]:
df.to_csv('test_automobile.txt',index=False)